name: "python-unet"
backend: "python"
max_batch_size: 0


input [
    {
        name: "input"
        data_type: TYPE_UINT8
        dims: [512, 512, 3 ]
    }
]

output [
    {
        name: "output"
        data_type: TYPE_FP32
        dims: [1, 512, 512, 3 ]
    }
]

instance_group [
    {
        count: 1
        kind: KIND_CPU
    }
]